analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/spixfc_regs.h
/**
 * @file    spixfc_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the SPIXFC Peripheral Module.
 * @note    This file is @generated.
 */
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc., All Rights Reserved.
 * (now owned by Analog Devices, Inc.)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_SPIXFC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_SPIXFC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     spixfc
 * @defgroup    spixfc_registers SPIXFC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the SPIXFC Peripheral Module.
 * @details     SPI XiP Flash Configuration Controller
 */

/**
 * @ingroup spixfc_registers
 * Structure type to access the SPIXFC Registers.
 */
typedef struct {
    __IO uint32_t cfg;                  /**< <tt>\b 0x00:</tt> SPIXFC CFG Register */
    __IO uint32_t ss_pol;               /**< <tt>\b 0x04:</tt> SPIXFC SS_POL Register */
    __IO uint32_t gen_ctrl;             /**< <tt>\b 0x08:</tt> SPIXFC GEN_CTRL Register */
    __IO uint32_t fifo_ctrl;            /**< <tt>\b 0x0C:</tt> SPIXFC FIFO_CTRL Register */
    __IO uint32_t sp_ctrl;              /**< <tt>\b 0x10:</tt> SPIXFC SP_CTRL Register */
    __IO uint32_t int_fl;               /**< <tt>\b 0x14:</tt> SPIXFC INT_FL Register */
    __IO uint32_t int_en;               /**< <tt>\b 0x18:</tt> SPIXFC INT_EN Register */
} mxc_spixfc_regs_t;

/* Register offsets for module SPIXFC */
/**
 * @ingroup    spixfc_registers
 * @defgroup   SPIXFC_Register_Offsets Register Offsets
 * @brief      SPIXFC Peripheral Register Offsets from the SPIXFC Base Peripheral Address.
 * @{
 */
#define MXC_R_SPIXFC_CFG                   ((uint32_t)0x00000000UL) /**< Offset from SPIXFC Base Address: <tt> 0x0000</tt> */
#define MXC_R_SPIXFC_SS_POL                ((uint32_t)0x00000004UL) /**< Offset from SPIXFC Base Address: <tt> 0x0004</tt> */
#define MXC_R_SPIXFC_GEN_CTRL              ((uint32_t)0x00000008UL) /**< Offset from SPIXFC Base Address: <tt> 0x0008</tt> */
#define MXC_R_SPIXFC_FIFO_CTRL             ((uint32_t)0x0000000CUL) /**< Offset from SPIXFC Base Address: <tt> 0x000C</tt> */
#define MXC_R_SPIXFC_SP_CTRL               ((uint32_t)0x00000010UL) /**< Offset from SPIXFC Base Address: <tt> 0x0010</tt> */
#define MXC_R_SPIXFC_INT_FL                ((uint32_t)0x00000014UL) /**< Offset from SPIXFC Base Address: <tt> 0x0014</tt> */
#define MXC_R_SPIXFC_INT_EN                ((uint32_t)0x00000018UL) /**< Offset from SPIXFC Base Address: <tt> 0x0018</tt> */
/**@} end of group spixfc_registers */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_CFG SPIXFC_CFG
 * @brief    Configuration Register.
 * @{
 */
#define MXC_F_SPIXFC_CFG_SSEL_POS                      0 /**< CFG_SSEL Position */
#define MXC_F_SPIXFC_CFG_SSEL                          ((uint32_t)(0x7UL << MXC_F_SPIXFC_CFG_SSEL_POS)) /**< CFG_SSEL Mask */
#define MXC_V_SPIXFC_CFG_SSEL_SLAVE_0                  ((uint32_t)0x0UL) /**< CFG_SSEL_SLAVE_0 Value */
#define MXC_S_SPIXFC_CFG_SSEL_SLAVE_0                  (MXC_V_SPIXFC_CFG_SSEL_SLAVE_0 << MXC_F_SPIXFC_CFG_SSEL_POS) /**< CFG_SSEL_SLAVE_0 Setting */
#define MXC_V_SPIXFC_CFG_SSEL_SLAVE_1                  ((uint32_t)0x1UL) /**< CFG_SSEL_SLAVE_1 Value */
#define MXC_S_SPIXFC_CFG_SSEL_SLAVE_1                  (MXC_V_SPIXFC_CFG_SSEL_SLAVE_1 << MXC_F_SPIXFC_CFG_SSEL_POS) /**< CFG_SSEL_SLAVE_1 Setting */

#define MXC_F_SPIXFC_CFG_MODE_POS                      4 /**< CFG_MODE Position */
#define MXC_F_SPIXFC_CFG_MODE                          ((uint32_t)(0x3UL << MXC_F_SPIXFC_CFG_MODE_POS)) /**< CFG_MODE Mask */
#define MXC_V_SPIXFC_CFG_MODE_SPIX_MODE_0              ((uint32_t)0x0UL) /**< CFG_MODE_SPIX_MODE_0 Value */
#define MXC_S_SPIXFC_CFG_MODE_SPIX_MODE_0              (MXC_V_SPIXFC_CFG_MODE_SPIX_MODE_0 << MXC_F_SPIXFC_CFG_MODE_POS) /**< CFG_MODE_SPIX_MODE_0 Setting */
#define MXC_V_SPIXFC_CFG_MODE_SPIX_MODE_3              ((uint32_t)0x3UL) /**< CFG_MODE_SPIX_MODE_3 Value */
#define MXC_S_SPIXFC_CFG_MODE_SPIX_MODE_3              (MXC_V_SPIXFC_CFG_MODE_SPIX_MODE_3 << MXC_F_SPIXFC_CFG_MODE_POS) /**< CFG_MODE_SPIX_MODE_3 Setting */

#define MXC_F_SPIXFC_CFG_PAGE_SIZE_POS                 6 /**< CFG_PAGE_SIZE Position */
#define MXC_F_SPIXFC_CFG_PAGE_SIZE                     ((uint32_t)(0x3UL << MXC_F_SPIXFC_CFG_PAGE_SIZE_POS)) /**< CFG_PAGE_SIZE Mask */
#define MXC_V_SPIXFC_CFG_PAGE_SIZE_4_BYTES             ((uint32_t)0x0UL) /**< CFG_PAGE_SIZE_4_BYTES Value */
#define MXC_S_SPIXFC_CFG_PAGE_SIZE_4_BYTES             (MXC_V_SPIXFC_CFG_PAGE_SIZE_4_BYTES << MXC_F_SPIXFC_CFG_PAGE_SIZE_POS) /**< CFG_PAGE_SIZE_4_BYTES Setting */
#define MXC_V_SPIXFC_CFG_PAGE_SIZE_8_BYTES             ((uint32_t)0x1UL) /**< CFG_PAGE_SIZE_8_BYTES Value */
#define MXC_S_SPIXFC_CFG_PAGE_SIZE_8_BYTES             (MXC_V_SPIXFC_CFG_PAGE_SIZE_8_BYTES << MXC_F_SPIXFC_CFG_PAGE_SIZE_POS) /**< CFG_PAGE_SIZE_8_BYTES Setting */
#define MXC_V_SPIXFC_CFG_PAGE_SIZE_16_BYTES            ((uint32_t)0x2UL) /**< CFG_PAGE_SIZE_16_BYTES Value */
#define MXC_S_SPIXFC_CFG_PAGE_SIZE_16_BYTES            (MXC_V_SPIXFC_CFG_PAGE_SIZE_16_BYTES << MXC_F_SPIXFC_CFG_PAGE_SIZE_POS) /**< CFG_PAGE_SIZE_16_BYTES Setting */
#define MXC_V_SPIXFC_CFG_PAGE_SIZE_32_BYTES            ((uint32_t)0x3UL) /**< CFG_PAGE_SIZE_32_BYTES Value */
#define MXC_S_SPIXFC_CFG_PAGE_SIZE_32_BYTES            (MXC_V_SPIXFC_CFG_PAGE_SIZE_32_BYTES << MXC_F_SPIXFC_CFG_PAGE_SIZE_POS) /**< CFG_PAGE_SIZE_32_BYTES Setting */

#define MXC_F_SPIXFC_CFG_HI_CLK_POS                    8 /**< CFG_HI_CLK Position */
#define MXC_F_SPIXFC_CFG_HI_CLK                        ((uint32_t)(0xFUL << MXC_F_SPIXFC_CFG_HI_CLK_POS)) /**< CFG_HI_CLK Mask */
#define MXC_V_SPIXFC_CFG_HI_CLK_16_SCLK                ((uint32_t)0x0UL) /**< CFG_HI_CLK_16_SCLK Value */
#define MXC_S_SPIXFC_CFG_HI_CLK_16_SCLK                (MXC_V_SPIXFC_CFG_HI_CLK_16_SCLK << MXC_F_SPIXFC_CFG_HI_CLK_POS) /**< CFG_HI_CLK_16_SCLK Setting */

#define MXC_F_SPIXFC_CFG_LO_CLK_POS                    12 /**< CFG_LO_CLK Position */
#define MXC_F_SPIXFC_CFG_LO_CLK                        ((uint32_t)(0xFUL << MXC_F_SPIXFC_CFG_LO_CLK_POS)) /**< CFG_LO_CLK Mask */
#define MXC_V_SPIXFC_CFG_LO_CLK_16_SCLK                ((uint32_t)0x0UL) /**< CFG_LO_CLK_16_SCLK Value */
#define MXC_S_SPIXFC_CFG_LO_CLK_16_SCLK                (MXC_V_SPIXFC_CFG_LO_CLK_16_SCLK << MXC_F_SPIXFC_CFG_LO_CLK_POS) /**< CFG_LO_CLK_16_SCLK Setting */

