analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/spixfc_regs.h
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE_RX_POS            21 /**< GEN_CTRL_SIMPLE_RX Position */
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE_RX                ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SIMPLE_RX_POS)) /**< GEN_CTRL_SIMPLE_RX Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE_SS_POS            22 /**< GEN_CTRL_SIMPLE_SS Position */
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE_SS                ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SIMPLE_SS_POS)) /**< GEN_CTRL_SIMPLE_SS Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_POS              24 /**< GEN_CTRL_SCLK_FB Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCLK_FB                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_POS)) /**< GEN_CTRL_SCLK_FB Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_INVERT_POS       25 /**< GEN_CTRL_SCLK_FB_INVERT Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_INVERT           ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_INVERT_POS)) /**< GEN_CTRL_SCLK_FB_INVERT Mask */

/**@} end of group SPIXFC_GEN_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_FIFO_CTRL SPIXFC_FIFO_CTRL
 * @brief    SPIX Controller FIFO Control and Status Register.
 * @{
 */
#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_AE_LVL_POS      0 /**< FIFO_CTRL_TX_FIFO_AE_LVL Position */
#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_AE_LVL          ((uint32_t)(0xFUL << MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_AE_LVL_POS)) /**< FIFO_CTRL_TX_FIFO_AE_LVL Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_CNT_POS         8 /**< FIFO_CTRL_TX_FIFO_CNT Position */
#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_CNT             ((uint32_t)(0x1FUL << MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_CNT_POS)) /**< FIFO_CTRL_TX_FIFO_CNT Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_AF_LVL_POS      16 /**< FIFO_CTRL_RX_FIFO_AF_LVL Position */
#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_AF_LVL          ((uint32_t)(0x1FUL << MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_AF_LVL_POS)) /**< FIFO_CTRL_RX_FIFO_AF_LVL Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_CNT_POS         24 /**< FIFO_CTRL_RX_FIFO_CNT Position */
#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_CNT             ((uint32_t)(0x3FUL << MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_CNT_POS)) /**< FIFO_CTRL_RX_FIFO_CNT Mask */

/**@} end of group SPIXFC_FIFO_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SP_CTRL SPIXFC_SP_CTRL
 * @brief    SPIX Controller Special Control Register.
 * @{
 */
#define MXC_F_SPIXFC_SP_CTRL_SAMPL_POS                 0 /**< SP_CTRL_SAMPL Position */
#define MXC_F_SPIXFC_SP_CTRL_SAMPL                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_SP_CTRL_SAMPL_POS)) /**< SP_CTRL_SAMPL Mask */

#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS              4 /**< SP_CTRL_SDIO_OUT Position */
#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT                  ((uint32_t)(0xFUL << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS)) /**< SP_CTRL_SDIO_OUT Mask */

#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS           8 /**< SP_CTRL_SDIO_OUT_EN Position */
#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN               ((uint32_t)(0xFUL << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS)) /**< SP_CTRL_SDIO_OUT_EN Mask */

#define MXC_F_SPIXFC_SP_CTRL_SCLKINH3_POS              16 /**< SP_CTRL_SCLKINH3 Position */
#define MXC_F_SPIXFC_SP_CTRL_SCLKINH3                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_SP_CTRL_SCLKINH3_POS)) /**< SP_CTRL_SCLKINH3 Mask */

/**@} end of group SPIXFC_SP_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INT_FL SPIXFC_INT_FL
 * @brief    SPIX Controller Interrupt Status Register.
 * @{
 */
#define MXC_F_SPIXFC_INT_FL_TX_STALLED_POS             0 /**< INT_FL_TX_STALLED Position */
#define MXC_F_SPIXFC_INT_FL_TX_STALLED                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_TX_STALLED_POS)) /**< INT_FL_TX_STALLED Mask */

#define MXC_F_SPIXFC_INT_FL_RX_STALLED_POS             1 /**< INT_FL_RX_STALLED Position */
#define MXC_F_SPIXFC_INT_FL_RX_STALLED                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_RX_STALLED_POS)) /**< INT_FL_RX_STALLED Mask */

#define MXC_F_SPIXFC_INT_FL_TX_READY_POS               2 /**< INT_FL_TX_READY Position */
#define MXC_F_SPIXFC_INT_FL_TX_READY                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_TX_READY_POS)) /**< INT_FL_TX_READY Mask */

#define MXC_F_SPIXFC_INT_FL_RX_DONE_POS                3 /**< INT_FL_RX_DONE Position */
#define MXC_F_SPIXFC_INT_FL_RX_DONE                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_RX_DONE_POS)) /**< INT_FL_RX_DONE Mask */

#define MXC_F_SPIXFC_INT_FL_TX_FIFO_AE_POS             4 /**< INT_FL_TX_FIFO_AE Position */
#define MXC_F_SPIXFC_INT_FL_TX_FIFO_AE                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_TX_FIFO_AE_POS)) /**< INT_FL_TX_FIFO_AE Mask */

#define MXC_F_SPIXFC_INT_FL_RX_FIFO_AF_POS             5 /**< INT_FL_RX_FIFO_AF Position */
#define MXC_F_SPIXFC_INT_FL_RX_FIFO_AF                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_RX_FIFO_AF_POS)) /**< INT_FL_RX_FIFO_AF Mask */

/**@} end of group SPIXFC_INT_FL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INT_EN SPIXFC_INT_EN
 * @brief    SPIX Controller Interrupt Enable Register.
 * @{
 */
#define MXC_F_SPIXFC_INT_EN_TX_STALLED_POS             0 /**< INT_EN_TX_STALLED Position */
#define MXC_F_SPIXFC_INT_EN_TX_STALLED                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_TX_STALLED_POS)) /**< INT_EN_TX_STALLED Mask */

#define MXC_F_SPIXFC_INT_EN_RX_STALLED_POS             1 /**< INT_EN_RX_STALLED Position */
#define MXC_F_SPIXFC_INT_EN_RX_STALLED                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_RX_STALLED_POS)) /**< INT_EN_RX_STALLED Mask */

#define MXC_F_SPIXFC_INT_EN_TX_READY_POS               2 /**< INT_EN_TX_READY Position */
#define MXC_F_SPIXFC_INT_EN_TX_READY                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_TX_READY_POS)) /**< INT_EN_TX_READY Mask */

#define MXC_F_SPIXFC_INT_EN_RX_DONE_POS                3 /**< INT_EN_RX_DONE Position */
#define MXC_F_SPIXFC_INT_EN_RX_DONE                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_RX_DONE_POS)) /**< INT_EN_RX_DONE Mask */

#define MXC_F_SPIXFC_INT_EN_TX_FIFO_AE_POS             4 /**< INT_EN_TX_FIFO_AE Position */
#define MXC_F_SPIXFC_INT_EN_TX_FIFO_AE                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_TX_FIFO_AE_POS)) /**< INT_EN_TX_FIFO_AE Mask */

#define MXC_F_SPIXFC_INT_EN_RX_FIFO_AF_POS             5 /**< INT_EN_RX_FIFO_AF Position */
#define MXC_F_SPIXFC_INT_EN_RX_FIFO_AF                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_RX_FIFO_AF_POS)) /**< INT_EN_RX_FIFO_AF Mask */

/**@} end of group SPIXFC_INT_EN_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_SPIXFC_REGS_H_
